mosfet79/Albanet_Firmware_Destroy/BOT_PRF_3X_Version/SWD/BOT_LITE_SENSORS/Projects/P-NUCLEO-WB55.USBDongle/Applications/BLE/BLE_Albanet_Demo/STM32_WPAN/app/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void * pPayload );
static void BLE_StatusNot( HCI_TL_CmdStatus_t status );
static void Ble_Tl_Init( void );
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress( void );


static void Adv_Request( APP_BLE_ConnStatus_t New_Status );
static void Adv_Cancel( void );
static void Adv_Cancel_Req( void );
static void Switch_OFF_GPIO( void );


#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle);
static void Connection_Interval_Update_Req( void );
#endif


/* USER CODE BEGIN PFP */
#if (P2P_SERVER1 != 0)
static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME ,'B','O','T',' ','O','T','A'};
uint8_t manuf_data[14] = {
      sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
      0x01/*SKD version */,
      CFG_DEV_ID_P2P_SERVER1 /* STM32WB - P2P Server 1*/,
      0x00 /* GROUP A Feature  */,
      0x00 /* GROUP A Feature */,
      0x00 /* GROUP B Feature */,
      0x00 /* GROUP B Feature */,
      0x00, /* BLE MAC start -MSB */
      0x00,
      0x00,
      0x00,
      0x00,
      0x00, /* BLE MAC stop */
  };
#endif
  /**
   * Advertising Data
   */
#if (P2P_SERVER2 != 0)
static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '2'};
uint8_t manuf_data[14] = {
      sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
      0x01/*SKD version */,
      CFG_DEV_ID_P2P_SERVER2 /* STM32WB - P2P Server 2*/,
      0x00 /* GROUP A Feature  */,
      0x00 /* GROUP A Feature */,
      0x00 /* GROUP B Feature */,
      0x00 /* GROUP B Feature */,
      0x00, /* BLE MAC start -MSB */
      0x00,
      0x00,
      0x00,
      0x00,
      0x00, /* BLE MAC stop */
 };

 #endif

 #if (P2P_SERVER3 != 0)
 static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '3'};
 uint8_t manuf_data[14] = {
      sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
      0x01/*SKD version */,
      CFG_DEV_ID_P2P_SERVER3 /* STM32WB - P2P Server 3*/,
      0x00 /* GROUP A Feature  */,
      0x00 /* GROUP A Feature */,
      0x00 /* GROUP B Feature */,
      0x00 /* GROUP B Feature */,
      0x00, /* BLE MAC start -MSB */
      0x00,
      0x00,
      0x00,
      0x00,
      0x00, /* BLE MAC stop */
 };
 #endif

 #if (P2P_SERVER4 != 0)
 static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '4'};
  uint8_t manuf_data[14] = {
      sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
      0x01/*SKD version */,
      CFG_DEV_ID_P2P_SERVER4 /* STM32WB - P2P Server 4*/,
      0x00 /* GROUP A Feature  */,
      0x00 /* GROUP A Feature */,
      0x00 /* GROUP B Feature */,
      0x00 /* GROUP B Feature */,
      0x00, /* BLE MAC start -MSB */
      0x00,
      0x00,
      0x00,
      0x00,
      0x00, /* BLE MAC stop */
 };
 #endif

 #if (P2P_SERVER5 != 0)
 static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '5'};
 uint8_t manuf_data[14] = {
      sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
      0x01/*SKD version */,
      CFG_DEV_ID_P2P_SERVER5 /* STM32WB - P2P Server 5*/,
      0x00 /* GROUP A Feature  */,
      0x00 /* GROUP A Feature */,
      0x00 /* GROUP B Feature */,
      0x00 /* GROUP B Feature */,
      0x00, /* BLE MAC start -MSB */
      0x00,
      0x00,
      0x00,
      0x00,
      0x00, /* BLE MAC stop */
 };
 #endif

 #if (P2P_SERVER6 != 0)
 static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '6'};
 uint8_t manuf_data[14] = {
      sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
      0x01/*SKD version */,
      CFG_DEV_ID_P2P_SERVER6 /* STM32WB - P2P Server 1*/,
      0x00 /* GROUP A Feature  */,
      0x00 /* GROUP A Feature */,
      0x00 /* GROUP B Feature */,
      0x00 /* GROUP B Feature */,
      0x00, /* BLE MAC start -MSB */
      0x00,
      0x00,
      0x00,
      0x00,
      0x00, /* BLE MAC stop */
 };
 #endif


/* USER CODE END PFP */


 #if L2CAP_REQUEST_NEW_CONN_PARAM != 0
 #define SIZE_TAB_CONN_INT            2
 float tab_conn_interval[SIZE_TAB_CONN_INT] = {50, 1000} ; /* ms */
 uint8_t index_con_int, mutex;
 #endif

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init( void )
{
/* USER CODE BEGIN APP_BLE_Init_1 */

/* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                              /**< Header unused */
    {0,                                  /** pBleBufferAddress not used */
    0,                                  /** BleBufferSize not used */
    CFG_BLE_NUM_GATT_ATTRIBUTES,
    CFG_BLE_NUM_GATT_SERVICES,
    CFG_BLE_ATT_VALUE_ARRAY_SIZE,
    CFG_BLE_NUM_LINK,
    CFG_BLE_DATA_LENGTH_EXTENSION,
    CFG_BLE_PREPARE_WRITE_LIST_SIZE,
    CFG_BLE_MBLOCK_COUNT,
    CFG_BLE_MAX_ATT_MTU,
    CFG_BLE_SLAVE_SCA,
    CFG_BLE_MASTER_SCA,
    CFG_BLE_LSE_SOURCE,
    CFG_BLE_MAX_CONN_EVENT_LENGTH,
    CFG_BLE_HSE_STARTUP_TIME,
    CFG_BLE_VITERBI_MODE,
    CFG_BLE_OPTIONS,
    0,
    CFG_BLE_MAX_COC_INITIATOR_NBR,
    CFG_BLE_MIN_TX_POWER,
    CFG_BLE_MAX_TX_POWER}
  };

  /**
     * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Do not allow stop mode in the application
   */
#if (LOW_POWER_FEATURE == 0)
  UTIL_LPM_SetStopMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);
#endif

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  if (SHCI_C2_BLE_Init( &ble_init_cmd_packet ) != SHCI_Success)
  {
    Error_Handler();
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;  
  
